Revit 2027 API
ViewScheduleExportOptions(ViewScheduleExportOptions) Constructor
 Constructs a new copy of the input ViewScheduleExportOptions object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ViewScheduleExportOptions(
	ViewScheduleExportOptions other
)
Public Sub New (
	other As ViewScheduleExportOptions
)
public:
ViewScheduleExportOptions(
	ViewScheduleExportOptions^ other
)
new :
        other : ViewScheduleExportOptions -> ViewScheduleExportOptions
Parameters
other ViewScheduleExportOptions
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ViewScheduleExportOptions Class
ViewScheduleExportOptions Overload
Autodesk.Revit.DB Namespace